# CatalogX

### Dependências

In [2]:
import pandas

from utils import similarity, match

### Datasets de Exemplo

In [6]:
df1 = pandas.DataFrame(data={
    'id':   [0     , 1      , 2     ],
    'name': ['gago', 'paulo', 'tatu']
})

df2 = pandas.DataFrame(data={
    'cod':  [10    , 20    , 30    , 40    , 50     , 60     , 70    , 80    , 90     ],
    'name': ['gato', 'gago', 'galo', 'sapo', 'saulo', 'paulo', 'pato', 'tatu', 'teucu']
})

print('Nomes únicos')
print(df1)
print('-'*20,'\n')
print('Todos os nomes')
print(df2)

Nomes únicos
   id   name
0   0   gago
1   1  paulo
2   2   tatu
--------------------

Todos os nomes
   cod   name
0   10   gato
1   20   gago
2   30   galo
3   40   sapo
4   50  saulo
5   60  paulo
6   70   pato
7   80   tatu
8   90  teucu

### Match

In [7]:
df2['id'] = df2['name'].apply(lambda x : match(df=df1, _str=x))
df2

   cod   name  id
0   10   gato   0
1   20   gago   0
2   30   galo   0
3   40   sapo  -1
4   50  saulo   1
5   60  paulo   1
6   70   pato   1
7   80   tatu   2
8   90  teucu  -1

### Dataset Agregado

In [8]:
dfm = df2 \
    .drop('name', axis=1) \
    .merge(df1, on='id', how='left') \
    .fillna('---') \
    .groupby(['id', 'name'])['cod'] \
    .apply(list).reset_index()

dfm

   id   name           cod
0  -1    ---      [40, 90]
1   0   gago  [10, 20, 30]
2   1  paulo  [50, 60, 70]
3   2   tatu          [80]